
{
  "content": "# SANDEEP COACHING CLASSES\n## THE HUMAN EYE AND THE COLOURFUL WORLD\n### Class 10 – Science (NCERT 2025)\n#### Detailed Comprehensive Study Notes\n\n\n### Introduction to the Human Eye\nThe **Human Eye** is one of the most valuable and sensitive sense organs. It enables us to see the wonderful world and the colours around us. It acts like a camera, focusing light through a lens system to form an image on a light-sensitive screen.\n\n\nThe eye is roughly spherical in shape with a diameter of about $2.3 \\text{ cm}$. Understanding the anatomy and functional mechanisms of the eye is crucial for studying how we perceive visual information.\n\n\n### Structure of the Human Eye\nThe human eye consists of several vital parts that work together to facilitate vision:\n\n\n1. **Cornea**: It is a thin, transparent membrane that forms the front bulge of the eye. Most of the refraction (bending) of light rays entering the eye occurs at the outer surface of the cornea.\n\n\n2. **Iris**: Behind the cornea is the **Iris**, a dark muscular diaphragm that controls the size of the pupil. It gives the eye its distinct colour (brown, blue, green, etc.).\n\n\n3. **Pupil**: The **Pupil** is the central aperture in the iris. It regulates and controls the amount of light entering the eye. In bright light, the pupil contracts; in dim light, it expands.\n\n\n4. **Eye Lens**: It is a convex lens made of transparent, soft, and flexible jelly-like material. It provides the finer adjustment of focal length required to focus objects at different distances on the retina.\n\n\n5. **Ciliary Muscles**: These muscles hold the eye lens in place and help in changing the curvature (and thus the focal length) of the lens to focus on objects at various distances.\n\n\n6. **Retina**: This is a light-sensitive screen at the back of the eye where the image is formed. It contains a large number of light-sensitive cells called **Rods** (sensitive to intensity) and **Cones** (sensitive to colours).\n\n\n7. **Optic Nerve**: The light-sensitive cells of the retina generate electrical signals when illuminated. These signals are sent to the brain via the **Optic Nerve**, which the brain then interprets as images.\n\n\n### Power of Accommodation\nThe ability of the eye lens to adjust its focal length is called **Accommodation**. \n\n\nWhen the ciliary muscles are relaxed, the lens becomes thin, increasing its focal length to see distant objects clearly. When the ciliary muscles contract, the lens becomes thicker (more convex), decreasing its focal length to see nearby objects clearly.\n\n\n**Near Point (Least Distance of Distinct Vision)**: The minimum distance at which an object can be seen most distinctly without strain. For a normal adult eye, it is $25 \\text{ cm}$.\n\n\n**Far Point**: The farthest point up to which the eye can see objects clearly. For a normal eye, it is **Infinity**.\n\n\n### Defects of Vision and Their Correction\nSometimes, the eye loses its power of accommodation. In such cases, the person cannot see objects clearly and comfortably. There are three common refractive defects of vision:\n\n\n1. **Myopia (Near-sightedness)**:\n- A person can see nearby objects clearly but cannot see distant objects distinctly.\n- The image is formed **in front of the retina** instead of on it.\n- **Causes**: Excessive curvature of the eye lens or elongation of the eyeball.\n- **Correction**: Using a **Concave Lens** of suitable power. This lens diverges the light rays before they enter the eye, allowing them to focus exactly on the retina.\n\n\n2. **Hypermetropia (Far-sightedness)**:\n- A person can see distant objects clearly but cannot see nearby objects distinctly.\n- The image of a nearby object is formed **behind the retina**.\n- **Causes**: The focal length of the eye lens is too long or the eyeball has become too small.\n- **Correction**: Using a **Convex Lens** of suitable power. This lens provides the additional focusing power required to bring the image onto the retina.\n\n\n3. **Presbyopia**:\n- With aging, the power of accommodation of the eye usually decreases. People find it difficult to see nearby objects comfortably and distinctly without corrective eye-glasses.\n- **Causes**: Gradual weakening of the ciliary muscles and diminishing flexibility of the eye lens.\n- **Correction**: Using **Bifocal Lenses**, which consist of both concave (upper portion for distant vision) and convex (lower portion for near vision) lenses.\n\n\n### Refraction of Light Through a Prism\nA **Prism** is a transparent refracting medium bounded by two plane surfaces inclined at an angle. \n\n\nThe **Angle of Deviation** ($D$) is the angle between the incident ray and the emergent ray. When a ray of light passes through a glass prism, it bends towards the base of the prism.\n\n\n### Dispersion of White Light\nThe phenomenon of splitting of white light into its seven constituent colours ($VIBGYOR$) when passed through a glass prism is called **Dispersion**.\n\n\n- **Spectrum**: The band of the coloured components of a light beam is called its spectrum. \n- Isaac Newton was the first to use a glass prism to obtain the spectrum of sunlight. He showed that if a second identical prism is placed in an inverted position with respect to the first, the colours recombine to form **White Light**.\n\n\n**Rainbow Formation**: A rainbow is a natural spectrum appearing in the sky after a rain shower. It is caused by the dispersion of sunlight by tiny water droplets, which act like small prisms. The process involves **Refraction**, **Dispersion**, and **Internal Reflection**.\n\n\n### Atmospheric Refraction\nThe refraction of light caused by the Earth's atmosphere (due to varying optical densities of air layers) is called **Atmospheric Refraction**.\n\n\n1. **Twinkling of Stars**: The physical conditions of the atmosphere are not stationary. As the light from a point-sized star passes through varying layers of the atmosphere, its apparent position fluctuates and the amount of light entering the eye flickers, causing the twinkling effect. (Note: Planets do not twinkle because they are closer and act as extended sources of light).\n\n\n2. **Advanced Sunrise and Delayed Sunset**: The Sun is visible to us about $2$ minutes before the actual sunrise and about $2$ minutes after the actual sunset because of atmospheric refraction.\n\n\n### Scattering of Light\nScattering is the phenomenon where light rays are deviated from their straight path by striking particles like dust, water droplets, or gas molecules.\n\n\n**Tyndall Effect**: When a beam of light strikes fine particles in a medium (like smoke or dust in a room), the path of the beam becomes visible. This is known as the Tyndall effect.\n\n\n**Colour of the Sky**: The molecules of air and other fine particles in the atmosphere have sizes smaller than the wavelength of visible light. These particles are more effective in scattering light of shorter wavelengths (blue) than light of longer wavelengths (red). Therefore, the sky appears **Blue**.\n\n\n**Reddening of the Sun at Sunrise and Sunset**: During sunrise and sunset, light from the Sun near the horizon passes through thicker layers of air and a larger distance in the Earth’s atmosphere. Most of the blue light and shorter wavelengths are scattered away by the particles. Therefore, the light that reaches our eyes is of longer wavelengths (red), giving the Sun a reddish appearance.\n\n\n### Important Formulas Summary\n- Power of a Lens ($P$): $P = \\frac{1}{f \\text{ (in meters)}}$\n- Unit of Power: **Dioptre** ($D$)\n- Lens Formula (relevant for calculations): $\\frac{1}{f} = \\frac{1}{v} - \\frac{1}{u}$"
}
