{
  "content": "[CENTER] # SANDEEP COACHING CLASSES\n[CENTER] ## THE HUMAN EYE AND THE COLOURFUL WORLD\n[CENTER] ### Class 10 – Science (NCERT 2025)\n[CENTER] ---\n\n\n### 1. The Human Eye: Structure and Function\n\nThe **Human Eye** is one of the most valuable and sensitive sense organs. It enables us to see the wonderful world and the colours around us. It works on the principle of **refraction of light** through a natural convex lens made of transparent living material.\n\n**Key Components of the Human Eye:**\n\n*   **Cornea:** The transparent spherical membrane covering the front of the eye. Light enters the eye through the cornea. Most of the refraction occurs at the outer surface of the cornea.\n*   **Iris:** A dark muscular diaphragm that controls the size of the pupil. It gives the eye its distinctive colour.\n*   **Pupil:** The central hole in the iris. It regulates and controls the amount of light entering the eye. In bright light, the pupil contracts; in dim light, it expands.\n*   **Eye Lens:** A transparent, biconvex structure made of crystalline protein. It provides the finer adjustment of focal length required to focus objects at different distances on the retina.\n*   **Ciliary Muscles:** These muscles hold the eye lens in position and modify its curvature. By contracting or relaxing, they change the focal length of the lens.\n*   **Retina:** A delicate membrane acting as a screen. It contains a vast number of light-sensitive cells called **rods** (respond to intensity) and **cones** (respond to colours).\n*   **Optic Nerve:** Transmits visual information (electrical signals) from the retina to the brain.\n\n[DIAGRAM: Structure of the Human Eye showing Cornea, Iris, Pupil, Lens, Retina, and Optic Nerve]\n\n\n### 2. Power of Accommodation\n\nThe ability of the eye lens to adjust its **focal length** is called **accommodation**.\n\n*   **When Ciliary Muscles Relax:** The lens becomes thin, its focal length increases, and we can see distant objects clearly.\n*   **When Ciliary Muscles Contract:** The lens becomes thick/curved, its focal length decreases, and we can see nearby objects clearly.\n\n**Important Limits:**\n*   **Near Point (Least Distance of Distinct Vision):** The minimum distance at which objects can be seen most distinctly without strain. For a normal adult eye, it is $25\\text{ cm}$.\n*   **Far Point:** The farthest point up to which the eye can see objects clearly. For a normal eye, it is **Infinity**.\n\n\n### 3. Defects of Vision and Their Correction\n\nSometimes the eye loses its power of accommodation. In such conditions, the person cannot see objects clearly and comfortably.\n\n#### A. Myopia (Near-sightedness)\n*   **Definition:** A person can see nearby objects clearly but cannot see distant objects distinctly.\n*   **Cause:** Excessive curvature of the eye lens or elongation of the eyeball.\n*   **Image Formation:** The image of a distant object is formed **in front of the retina**.\n*   **Correction:** Use of a **Concave Lens** of suitable power.\n\n[DIAGRAM: Myopic Eye and Correction using Concave Lens]\n\n#### B. Hypermetropia (Far-sightedness)\n*   **Definition:** A person can see distant objects clearly but cannot see nearby objects distinctly.\n*   **Cause:** Focal length of the eye lens is too long or the eyeball has become too small.\n*   **Image Formation:** The image of a nearby object is formed **behind the retina**.\n*   **Correction:** Use of a **Convex Lens** of suitable power.\n\n[DIAGRAM: Hypermetropic Eye and Correction using Convex Lens]\n\n#### C. Presbyopia\n*   **Definition:** The power of accommodation of the eye usually decreases with ageing. The near point gradually recedes.\n*   **Cause:** Gradual weakening of ciliary muscles and diminishing flexibility of the eye lens.\n*   **Correction:** Use of **Bifocal Lenses** (upper part is concave for distant vision, lower part is convex for near vision).\n\n\n### 4. Refraction of Light through a Prism\n\nA **Prism** is a transparent refracting medium bounded by at least two lateral surfaces, inclined to each other at a certain angle.\n\n*   **Angle of Prism ($A$):** The angle between two lateral faces.\n*   **Angle of Deviation ($\\delta$):** The angle between the incident ray produced forward and the emergent ray produced backward.\n\n[DIAGRAM: Refraction through a Glass Prism showing Incident Ray, Refracted Ray, Emergent Ray, and Angle of Deviation]\n\n\n### 5. Dispersion of White Light\n\nThe phenomenon of splitting of white light into its seven constituent colours ($VIBGYOR$) when passed through a glass prism is called **Dispersion**.\n\n*   **Spectrum:** The band of the coloured components of a light beam.\n*   **Cause:** Different colours of light travel at different speeds in a medium (like glass) and bend through different angles. **Red** light bends the least, while **Violet** light bends the most.\n\n**Newton’s Experiment:** Sir Isaac Newton used a second identical prism in an inverted position to recombine the spectrum back into white light.\n\n[DIAGRAM: Dispersion of White Light by a Glass Prism and Recombination of Spectrum]\n\n\n### 6. Atmospheric Refraction\n\nThe refraction of light caused by the Earth's atmosphere (due to varying optical densities of air layers) is called **Atmospheric Refraction**.\n\n**Key Phenomena:**\n1.  **Twinkling of Stars:** Stars are point-sized sources of light very far away. As the path of rays varies due to changing atmospheric conditions, the apparent position of the star fluctuates, and the amount of light entering the eye flickers.\n2.  **Apparent Position of Stars:** Stars appear slightly higher than their actual position.\n3.  **Advanced Sunrise and Delayed Sunset:** The Sun is visible to us about $2\\text{ minutes}$ before the actual sunrise and $2\\text{ minutes}$ after the actual sunset due to atmospheric refraction.\n\n[DIAGRAM: Atmospheric Refraction causing Advanced Sunrise and Delayed Sunset]\n\n\n### 7. Scattering of Light\n\nThe phenomenon where light rays are deviated from their straight path after striking obstacles like dust, water droplets, or air molecules.\n\n#### A. Tyndall Effect\nWhen a beam of light strikes fine particles (like smoke or tiny water droplets in a dark room), the path of the beam becomes visible. This is the **Tyndall Effect**.\n\n#### B. Colour of the Sky\n*   The molecules of air and other fine particles in the atmosphere have a size smaller than the wavelength of visible light.\n*   These particles are more effective in scattering light of shorter wavelengths (**blue** end) than light of longer wavelengths (**red** end).\n*   Thus, when sunlight passes through the atmosphere, the blue colour is scattered more strongly, making the sky appear **Blue**.\n\n#### C. Colour of the Sun at Sunrise and Sunset\n*   During sunrise and sunset, light has to travel a thicker layer of atmosphere.\n*   Most of the shorter wavelengths (blue) are scattered away.\n*   The light that reaches our eyes is of longer wavelengths (**Red**), giving the Sun a reddish appearance.\n\n[DIAGRAM: Scattering of light at Sunrise/Sunset vs Noon]\n\n\n### 8. Formulae Summary\n\n*   **Lens Formula:** $\\frac{1}{f} = \\frac{1}{v} - \\frac{1}{u}$\n*   **Power of Lens:** $P = \\frac{1}{f \\text{ (in meters)}}$\n*   **Relationship between $P$ and $D$:** Power is measured in **Dioptres (D)**.\n\n---\n[CENTER] **END OF NOTES**\n[CENTER] *Practice the diagrams thoroughly for Board Exams 2025.*"
}
