{
  "content": "[CENTER] # SANDEEP COACHING CLASSES\n[CENTER] ## THE HUMAN EYE AND THE COLOURFUL WORLD\n[CENTER] ### Class 10 – Science (NCERT 2025)\n[CENTER] ---\n\n### 1. The Human Eye\nThe **Human Eye** is one of the most valuable and sensitive sense organs. It uses light and enables us to see the colorful world around us. It acts like a camera, focusing light onto a light-sensitive screen to form an image.\n\n**Main Parts of the Human Eye:**\n*   **Cornea:** The transparent spherical membrane covering the front of the eye. Light enters the eye mostly through the cornea.\n*   **Iris:** A dark muscular diaphragm that controls the size of the pupil.\n*   **Pupil:** The central hole in the iris that regulates and controls the amount of light entering the eye.\n*   **Crystalline Lens:** A convex lens made of transparent, soft, and flexible jelly-like material. It helps in focusing objects at different distances on the retina.\n*   **Ciliary Muscles:** These muscles hold the lens in position and help in changing the curvature/focal length of the eye lens.\n*   **Retina:** The light-sensitive inner surface of the eye where the image is formed. It contains rods and cones.\n*   **Optic Nerve:** Transmits visual information (electrical signals) from the retina to the brain.\n\n[DIAGRAM: Structure of the Human Eye]\n\n\n### 2. Power of Accommodation\nThe ability of the eye lens to adjust its focal length is called **Power of Accommodation**.\n\n*   **When Ciliary Muscles Relax:** The lens becomes thin, its focal length increases, and we can see distant objects clearly.\n*   **When Ciliary Muscles Contract:** The lens becomes thick/curved, its focal length decreases, and we can see nearby objects clearly.\n*   **Near Point:** The minimum distance at which objects can be seen most distinctly without strain. For a normal adult eye, it is $25\\text{ cm}$.\n*   **Far Point:** The farthest point up to which the eye can see objects clearly. For a normal eye, it is **Infinity**.\n\n\n### 3. Defects of Vision and Their Correction\nSometimes, the eye loses its power of accommodation. In such cases, the person cannot see objects clearly and comfortably.\n\n**A. Myopia (Near-sightedness):**\n*   A person can see nearby objects clearly but cannot see distant objects distinctly.\n*   **Cause:** Excessive curvature of the eye lens or elongation of the eyeball.\n*   **Image Formation:** The image is formed **in front of the retina**.\n*   **Correction:** Use of a **Concave Lens** of suitable power.\n\n[DIAGRAM: Myopic Eye and Correction using Concave Lens]\n\n**B. Hypermetropia (Far-sightedness):**\n*   A person can see distant objects clearly but cannot see nearby objects distinctly.\n*   **Cause:** Focal length of the eye lens is too long or the eyeball has become too small.\n*   **Image Formation:** The image is formed **behind the retina**.\n*   **Correction:** Use of a **Convex Lens** of suitable power.\n\n[DIAGRAM: Hypermetropic Eye and Correction using Convex Lens]\n\n**C. Presbyopia:**\n*   With aging, the power of accommodation of the eye usually decreases. People find it difficult to see nearby objects comfortably without corrective eye-glasses.\n*   **Cause:** Gradual weakening of ciliary muscles and diminishing flexibility of the eye lens.\n*   **Correction:** Use of **Bifocal Lenses** (upper part is concave for distant vision, lower part is convex for near vision).\n\n\n### 4. Refraction of Light through a Prism\nA **Prism** is a transparent refracting medium bounded by at least two lateral surfaces, inclined to each other at a certain angle.\n\n*   **Angle of Prism ($A$):** The angle between the two lateral faces.\n*   **Angle of Deviation ($D$):** The angle between the incident ray and the emergent ray.\n\n[DIAGRAM: Refraction of Light through a Triangular Glass Prism]\n\n\n### 5. Dispersion of White Light\nThe splitting of white light into its component colors (VIBGYOR) when it passes through a glass prism is called **Dispersion**.\n\n*   **Spectrum:** The band of the colored components of a light beam (Violet, Indigo, Blue, Green, Yellow, Orange, Red).\n*   **Cause:** Different colors of light bend through different angles with respect to the incident beam as they pass through a prism. **Red light** bends the least, while **Violet light** bends the most.\n*   **Isaac Newton’s Experiment:** He showed that using a second inverted prism, the dispersed colors can be recombined to form white light again.\n\n[DIAGRAM: Dispersion of White Light and Recombination of Spectrum]\n\n\n### 6. Atmospheric Refraction\nThe refraction of light caused by the Earth's atmosphere (due to varying air densities) is called **Atmospheric Refraction**.\n\n**Phenomena caused by Atmospheric Refraction:**\n1.  **Twinkling of Stars:** Stars are point-sized sources of light. Due to the changing refractive index of the atmosphere, the apparent position of the star fluctuates, and the amount of light entering the eye flickers.\n2.  **Apparent Position of Stars:** Stars appear slightly higher than their actual position.\n3.  **Advanced Sunrise and Delayed Sunset:** The Sun is visible to us about $2\\text{ minutes}$ before the actual sunrise and about $2\\text{ minutes}$ after the actual sunset due to atmospheric refraction.\n\n[DIAGRAM: Atmospheric Refraction effect at Sunrise and Sunset]\n\n\n### 7. Scattering of Light\n**Scattering** is the phenomenon where light rays are deviated from their straight path by striking obstacles like dust, water droplets, or gas molecules.\n\n*   **Tyndall Effect:** The scattering of light by colloidal particles is called the Tyndall Effect. Examples: Path of light becoming visible in a smoke-filled room or in a dense canopy of a forest.\n*   **Why is the Color of the Clear Sky Blue?** Molecules of air (Nitrogen and Oxygen) are smaller than the wavelength of visible light. They are more effective in scattering light of shorter wavelengths (**Blue** end) than light of longer wavelengths (**Red** end).\n*   **Color of the Sun at Sunrise and Sunset:** During sunrise and sunset, light travels a longer distance through the atmosphere. Most of the blue light is scattered away, and only the longer wavelength **Red** light reaches our eyes.\n*   **Why do Planets not Twinkle?** Planets are much closer to Earth and are seen as extended sources (not point sources). The total variation in the amount of light entering our eye from all the individual point-sized sources averages out to zero.\n\n[DIAGRAM: Scattering of light - Blue Sky and Reddish Sun]\n\n[CENTER] ---\n[CENTER] *Sandeep Coaching Classes – Excellence in Science Education*"
}
